data/post-host-backnet/fio-libaio-2026-05-15.txt
Copr repo for python-scikit-learn owned by tcha  59 kB/s |  46 kB     00:00    
CentOS Stream 9 - BaseOS                        3.3 MB/s | 8.9 MB     00:02    
CentOS Stream 9 - AppStream                     3.2 MB/s |  27 MB     00:08    
CentOS Stream 9 - Extras packages                19 kB/s |  21 kB     00:01    
Extra Packages for Enterprise Linux 9 - x86_64  7.0 MB/s |  21 MB     00:02    
Extra Packages for Enterprise Linux 9 openh264  2.2 kB/s | 2.5 kB     00:01    
Dependencies resolved.
================================================================================
 Package                 Architecture Version             Repository       Size
================================================================================
Installing:
 fio                     x86_64       3.35-1.el9          appstream       6.2 M
Installing weak dependencies:
 fio-engine-http         x86_64       3.35-1.el9          appstream        18 k
 fio-engine-libaio       x86_64       3.35-1.el9          appstream        16 k
 fio-engine-nbd          x86_64       3.35-1.el9          appstream        15 k
 fio-engine-rados        x86_64       3.35-1.el9          appstream        16 k
 fio-engine-rbd          x86_64       3.35-1.el9          appstream        16 k
 fio-engine-rdma         x86_64       3.35-1.el9          appstream        21 k

Transaction Summary
================================================================================
Install  7 Packages

Total download size: 6.3 M
Installed size: 8.7 M
Downloading Packages:
(1/7): fio-engine-http-3.35-1.el9.x86_64.rpm     64 kB/s |  18 kB     00:00    
(2/7): fio-engine-libaio-3.35-1.el9.x86_64.rpm   54 kB/s |  16 kB     00:00    
(3/7): fio-engine-nbd-3.35-1.el9.x86_64.rpm     143 kB/s |  15 kB     00:00    
(4/7): fio-engine-rados-3.35-1.el9.x86_64.rpm   126 kB/s |  16 kB     00:00    
(5/7): fio-engine-rbd-3.35-1.el9.x86_64.rpm      41 kB/s |  16 kB     00:00    
(6/7): fio-engine-rdma-3.35-1.el9.x86_64.rpm     55 kB/s |  21 kB     00:00    
(7/7): fio-3.35-1.el9.x86_64.rpm                7.0 MB/s | 6.2 MB     00:00    
--------------------------------------------------------------------------------
Total                                           4.2 MB/s | 6.3 MB     00:01     
Running transaction check
Transaction check succeeded.
Running transaction test
Transaction test succeeded.
Running transaction
  Preparing        :                                                        1/1 
  Installing       : fio-engine-http-3.35-1.el9.x86_64                      1/7 
  Installing       : fio-engine-libaio-3.35-1.el9.x86_64                    2/7 
  Installing       : fio-engine-nbd-3.35-1.el9.x86_64                       3/7 
  Installing       : fio-engine-rados-3.35-1.el9.x86_64                     4/7 
  Installing       : fio-engine-rbd-3.35-1.el9.x86_64                       5/7 
  Installing       : fio-engine-rdma-3.35-1.el9.x86_64                      6/7 
  Installing       : fio-3.35-1.el9.x86_64                                  7/7 
  Running scriptlet: fio-3.35-1.el9.x86_64                                  7/7 
  Verifying        : fio-3.35-1.el9.x86_64                                  1/7 
  Verifying        : fio-engine-http-3.35-1.el9.x86_64                      2/7 
  Verifying        : fio-engine-libaio-3.35-1.el9.x86_64                    3/7 
  Verifying        : fio-engine-nbd-3.35-1.el9.x86_64                       4/7 
  Verifying        : fio-engine-rados-3.35-1.el9.x86_64                     5/7 
  Verifying        : fio-engine-rbd-3.35-1.el9.x86_64                       6/7 
  Verifying        : fio-engine-rdma-3.35-1.el9.x86_64                      7/7 

Installed:
  fio-3.35-1.el9.x86_64                   fio-engine-http-3.35-1.el9.x86_64    
  fio-engine-libaio-3.35-1.el9.x86_64     fio-engine-nbd-3.35-1.el9.x86_64     
  fio-engine-rados-3.35-1.el9.x86_64      fio-engine-rbd-3.35-1.el9.x86_64     
  fio-engine-rdma-3.35-1.el9.x86_64      

Complete!

=== Pre-fill: dd 30GB (fast; spills bluestore metadata cache for valid measurements) ===
30364663808 bytes (30 GB, 28 GiB) copied, 8 s, 3.8 GB/s
30720+0 records in
30720+0 records out
32212254720 bytes (32 GB, 30 GiB) copied, 100.976 s, 319 MB/s

real	1m40.986s
user	0m0.011s
sys	0m9.806s

=== fio: 4k QD32 randwrite (libaio direct=1), 60s — random write IOPS ceiling ===
qd32-randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.35
Starting 1 process

qd32-randwrite: (groupid=0, jobs=1): err= 0: pid=64: Fri May 15 09:59:50 2026
  write: IOPS=2184, BW=8738KiB/s (8947kB/s)(512MiB/60008msec); 0 zone resets
    slat (nsec): min=971, max=13378k, avg=8464.46, stdev=86057.47
    clat (usec): min=9326, max=60093, avg=14092.93, stdev=2399.59
     lat (usec): min=9328, max=60100, avg=14101.39, stdev=2402.64
    clat percentiles (usec):
     |  1.00th=[11994],  5.00th=[12387], 10.00th=[12518], 20.00th=[12780],
     | 30.00th=[13042], 40.00th=[13173], 50.00th=[13435], 60.00th=[13698],
     | 70.00th=[14091], 80.00th=[14746], 90.00th=[16581], 95.00th=[18220],
     | 99.00th=[21103], 99.50th=[23987], 99.90th=[43779], 99.95th=[52167],
     | 99.99th=[54789]
   bw (  KiB/s): min= 4352, max= 9984, per=100.00%, avg=9040.70, stdev=645.04, samples=115
   iops        : min= 1088, max= 2496, avg=2260.17, stdev=161.26, samples=115
  lat (msec)   : 10=0.03%, 20=98.24%, 50=1.67%, 100=0.07%
  cpu          : usr=0.39%, sys=4.63%, ctx=54625, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131081,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=8738KiB/s (8947kB/s), 8738KiB/s-8738KiB/s (8947kB/s-8947kB/s), io=512MiB (537MB), run=60008-60008msec

Disk stats (read/write):
  rbd0: ios=0/130852, merge=0/27, ticks=0/1832266, in_queue=1832266, util=96.14%

=== fio: 4k QD32 randread (libaio direct=1), 60s — random read IOPS ceiling ===
qd32-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.35
Starting 1 process

qd32-randread: (groupid=0, jobs=1): err= 0: pid=83: Fri May 15 10:00:51 2026
  read: IOPS=66.8k, BW=261MiB/s (274MB/s)(15.3GiB/60001msec)
    slat (nsec): min=864, max=3586.6k, avg=9126.33, stdev=15668.12
    clat (nsec): min=1802, max=26959k, avg=469408.37, stdev=253943.34
     lat (usec): min=72, max=26992, avg=478.53, stdev=254.89
    clat percentiles (usec):
     |  1.00th=[  159],  5.00th=[  202], 10.00th=[  237], 20.00th=[  289],
     | 30.00th=[  338], 40.00th=[  383], 50.00th=[  433], 60.00th=[  482],
     | 70.00th=[  545], 80.00th=[  619], 90.00th=[  742], 95.00th=[  840],
     | 99.00th=[ 1090], 99.50th=[ 1237], 99.90th=[ 2212], 99.95th=[ 3294],
     | 99.99th=[ 7898]
   bw (  KiB/s): min=163344, max=349680, per=100.00%, avg=267411.09, stdev=25377.01, samples=119
   iops        : min=40836, max=87420, avg=66852.77, stdev=6344.27, samples=119
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.05%, 250=12.33%
  lat (usec)   : 500=50.64%, 750=27.65%, 1000=7.63%
  lat (msec)   : 2=1.58%, 4=0.09%, 10=0.03%, 20=0.01%, 50=0.01%
  cpu          : usr=7.68%, sys=22.60%, ctx=2726447, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=4006787,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=261MiB/s (274MB/s), 261MiB/s-261MiB/s (274MB/s-274MB/s), io=15.3GiB (16.4GB), run=60001-60001msec

Disk stats (read/write):
  rbd0: ios=4001407/3, merge=0/1, ticks=1567387/25, in_queue=1567413, util=99.28%

=== fio: 1M QD8 seqwrite (libaio direct=1), 60s — write BW ceiling ===
qd8-seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
fio-3.35
Starting 1 process

qd8-seqwrite: (groupid=0, jobs=1): err= 0: pid=102: Fri May 15 10:01:51 2026
  write: IOPS=155, BW=156MiB/s (163MB/s)(9342MiB/60016msec); 0 zone resets
    slat (usec): min=13, max=44580, avg=95.22, stdev=679.17
    clat (msec): min=15, max=255, avg=51.29, stdev=23.32
     lat (msec): min=15, max=255, avg=51.39, stdev=23.33
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   27], 10.00th=[   28], 20.00th=[   32],
     | 30.00th=[   36], 40.00th=[   40], 50.00th=[   45], 60.00th=[   53],
     | 70.00th=[   59], 80.00th=[   68], 90.00th=[   85], 95.00th=[  101],
     | 99.00th=[  120], 99.50th=[  134], 99.90th=[  161], 99.95th=[  205],
     | 99.99th=[  255]
   bw (  KiB/s): min=51200, max=301056, per=100.00%, avg=159950.52, stdev=62687.60, samples=119
   iops        : min=   50, max=  294, avg=156.20, stdev=61.22, samples=119
  lat (msec)   : 20=0.22%, 50=55.94%, 100=38.85%, 250=4.98%, 500=0.01%
  cpu          : usr=0.56%, sys=0.24%, ctx=4737, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9342,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=156MiB/s (163MB/s), 156MiB/s-156MiB/s (163MB/s-163MB/s), io=9342MiB (9796MB), run=60016-60016msec

Disk stats (read/write):
  rbd0: ios=0/9348, merge=0/11, ticks=0/476749, in_queue=476749, util=99.87%

=== fio: 1M QD8 seqread (libaio direct=1), 60s — read BW ceiling ===
qd8-seqread: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
fio-3.35
Starting 1 process

qd8-seqread: (groupid=0, jobs=1): err= 0: pid=121: Fri May 15 10:02:51 2026
  read: IOPS=1535, BW=1535MiB/s (1610MB/s)(90.0GiB/60007msec)
    slat (nsec): min=1888, max=5987.1k, avg=31745.15, stdev=92989.02
    clat (usec): min=92, max=131192, avg=5177.03, stdev=2947.79
     lat (usec): min=1286, max=132353, avg=5208.78, stdev=2948.51
    clat percentiles (usec):
     |  1.00th=[ 1450],  5.00th=[ 1713], 10.00th=[ 2057], 20.00th=[ 2671],
     | 30.00th=[ 3359], 40.00th=[ 4080], 50.00th=[ 4883], 60.00th=[ 5669],
     | 70.00th=[ 6521], 80.00th=[ 7111], 90.00th=[ 8586], 95.00th=[10028],
     | 99.00th=[11994], 99.50th=[12911], 99.90th=[15270], 99.95th=[20317],
     | 99.99th=[90702]
   bw (  MiB/s): min= 1060, max= 1718, per=100.00%, avg=1535.24, stdev=97.31, samples=119
   iops        : min= 1060, max= 1718, avg=1535.24, stdev=97.31, samples=119
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=8.88%, 4=29.92%, 10=56.07%, 20=5.07%, 50=0.03%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.61%, sys=2.68%, ctx=103830, majf=0, minf=525
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=92129,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1535MiB/s (1610MB/s), 1535MiB/s-1535MiB/s (1610MB/s-1610MB/s), io=90.0GiB (96.6GB), run=60007-60007msec

Disk stats (read/write):
  rbd0: ios=91960/3, merge=0/1, ticks=476814/32, in_queue=476847, util=99.87%

=== Sleeping for dashboard inspection ===